Revit 2027 API
RevolvedFace Methods
The RevolvedFace type exposes the following members.
Methods
Name | Description
ComputeDerivatives | Returns the first partial derivatives of the underlying surface at the specified point.
(Inherited from Face)
ComputeNormal | Returns the normal vector for the face at the given point.
(Inherited from Face)
ComputeSecondDerivatives | Returns the second partial derivatives of the face at the specified point.
(Inherited from Face)
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals |  Determines whether the specified Object is equal to the current Object.
(Inherited from GeometryObject)
Evaluate | Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.
(Inherited from Face)
GetBoundingBox | Returns the UV bounding box of the face.
(Inherited from Face)
GetEdgesAsCurveLoops | Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
(Inherited from Face)
GetHashCode |  Gets the integer value of the geometry object as hash code
(Inherited from GeometryObject)
GetRegions | Gets the face regions (created, for example, by the Split Face command) of the face.
(Inherited from Face)
GetSurface | Returns a copy of this face's surface.
(Inherited from Face)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Intersect(Curve) | Calculates the intersection of the specified curve with this face.
(Inherited from Face)
Intersect(Face) | Calculates the intersection of the specified face with this face and returns the intersection results.
(Inherited from Face)
Intersect(Curve, IntersectionResultArray) | Calculates the intersection of the specified curve with this face and returns the intersection results.
(Inherited from Face)
Intersect(Face, Curve) | Calculates the intersection of the specified face with this face and returns the intersection results.
(Inherited from Face)
IsInside(UV) | Indicates whether the specified point is within this face.
(Inherited from Face)
IsInside(UV, IntersectionResult) | Indicates whether the specified point is within this face and outputs additional information about the point location.
(Inherited from Face)
Project | Projects the specified point on the face.
(Inherited from Face)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Triangulate() | Returns a triangular mesh approximation to the face.
(Inherited from Face)
Triangulate(Double) | Returns a triangular mesh approximation to the face.
(Inherited from Face)
Top
See Also
Reference
RevolvedFace Class
Autodesk.Revit.DB Namespace